<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"806205f91e69bcd66a739202304f43372387589922e6b7825426427633c8f83a","plan_job_ref":"Job Plan Airflow DAGs #496 at https://github.com/cal-itp/data-infra/actions/runs/17139160352","plan_out_hash":"1aebbcb33a5b506e3d4817eb7c2b45bf54bb1631d6b4327085d6f93eff7219f9","plan_hash":"41fb4eab6feb29ebc40016e85f8b098bb072180568c667a4a8f094fdf9dfd6d8","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_and_validate_rt_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "MTYFZg==" -> (known after apply)
!~      detect_md5hash      = "lgPkvsp0uMk6qCnlzSgQPw==" -> "different hash"
!~      generation          = 1753225938191544 -> (known after apply)
        id                  = "calitp-composer-dags/parse_and_validate_rt_v2/METADATA.yml"
!~      md5hash             = "lgPkvsp0uMk6qCnlzSgQPw==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "uJ/MXQ==" -> (known after apply)
!~      detect_md5hash      = "IfyLG7vg4mXGDF+jJCv+Ig==" -> "different hash"
!~      generation          = 1755712995519491 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "IfyLG7vg4mXGDF+jJCv+Ig==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "ntrzrw==" -> (known after apply)
!~      detect_md5hash      = "wvWESd4H/8BzPhKqCQkr/A==" -> "different hash"
!~      generation          = 1755712997195553 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "wvWESd4H/8BzPhKqCQkr/A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #496](https://github.com/cal-itp/data-infra/actions/runs/17139160352)